In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
#whatis DataFrame
#2d datastructure with 3 principle component(Rows, colmn, value)
#similar to table in an excel sheet
#labeled rows and colm values
#size is mutable

In [5]:
#create a dataframe from clipboard

In [6]:
age_df = pd.read_clipboard()
print(age_df)

  First name   Last name  Age
0       Tinu    Elejogun   14
1     Javier      Zapata   28
2       Lily   McGarrett   18
3  Olatunkbo    Chijiaku   22
4   Adrienne    Anthoula   22
5     Axelia  Athanasios   22
6  Jon-Kabat        Zinn   22
7    Thabang       Mosoa   15
8      Rhian       Ellis   12

In [7]:
#display Column Names

In [8]:
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [9]:
#access column values

In [10]:
age_df['First name']

0         Tinu
1       Javier
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8        Rhian
Name: First name, dtype: object

In [11]:
age_df[['First name', 'Age']]

  First name  Age
0       Tinu   14
1     Javier   28
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8      Rhian   12

In [12]:
#what  is NAN Value

In [13]:
#whenever value is not present

In [14]:
age_df['rank'] = np.nan
print(age_df)

  First name   Last name  Age  rank
0       Tinu    Elejogun   14   NaN
1     Javier      Zapata   28   NaN
2       Lily   McGarrett   18   NaN
3  Olatunkbo    Chijiaku   22   NaN
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8      Rhian       Ellis   12   NaN

In [15]:
#head and tail function

In [16]:
age_df.head()
#first five rows

  First name  Last name  Age  rank
0       Tinu   Elejogun   14   NaN
1     Javier     Zapata   28   NaN
2       Lily  McGarrett   18   NaN
3  Olatunkbo   Chijiaku   22   NaN
4   Adrienne   Anthoula   22   NaN

In [17]:
age_df.tail()
#last 5 element

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8      Rhian       Ellis   12   NaN

In [18]:
#assign values to a dataframe usiing 1.Numpy 2.series

In [24]:
array = np.arange(9)
print(array)

[0 1 2 3 4 5 6 7 8]

In [25]:
age_df['rank'] = array
print(age_df)

  First name   Last name  Age  rank
0       Tinu    Elejogun   14     0
1     Javier      Zapata   28     1
2       Lily   McGarrett   18     2
3  Olatunkbo    Chijiaku   22     3
4   Adrienne    Anthoula   22     4
5     Axelia  Athanasios   22     5
6  Jon-Kabat        Zinn   22     6
7    Thabang       Mosoa   15     7
8      Rhian       Ellis   12     8

In [27]:
new_rank_series = Series([10,11,12],index=[3,5,6])
print(new_rank_series)
age_df['rank'] = new_rank_series
print(age_df)

3    10
5    11
6    12
dtype: int64
  First name   Last name  Age  rank
0       Tinu    Elejogun   14   NaN
1     Javier      Zapata   28   NaN
2       Lily   McGarrett   18   NaN
3  Olatunkbo    Chijiaku   22  10.0
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22  11.0
6  Jon-Kabat        Zinn   22  12.0
7    Thabang       Mosoa   15   NaN
8      Rhian       Ellis   12   NaN

In [28]:
#delete a column

In [29]:
del(age_df['Last name'])
print(age_df)

  First name  Age  rank
0       Tinu   14   NaN
1     Javier   28   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8      Rhian   12   NaN

In [30]:
#convert Diictionary to dataframe

In [31]:
simple_dict = {
    'company' : ['Nastle', 'PG'],
    'Profit' : [1000,500]
}
print(simple_dict)

{'company': ['Nastle', 'PG'], 'Profit': [1000, 500]}

In [33]:
sample_df = DataFrame(simple_dict)
print(sample_df)

  company  Profit
0  Nastle    1000
1      PG     500